Revit 2026 API

# BalusterPlacement Properties

---

The BalusterPlacement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BalusterPattern | Accesses the object containing properties related to the baluster pattern. |
|  | BalusterPerTreadFamilyId | The id of baluster per tread family. |
|  | BalusterPerTreadNumber | The number of balusters per tread. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PostPattern | Accesses the object containing properties related to the post pattern. |
|  | UseBalusterPerTreadOnStairs | If true, one or more balusters will be included on each tread of an associated stair. If false, this is not guaranteed to happen. |

#### Reference

BalusterPlacement Class

Autodesk.Revit.DB.Architecture Namespace